rails-app/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    if article_params[:purge_image] == "1"
      @article.image.purge
    end

    if @article.update(article_params.to_h.except(:purge_image))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 3 LIMIT 1
UPDATE "articles" SET "updated_at" = '2026-07-09 23:45:53.236627' WHERE "articles"."id" = 8