rails-app/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('Local Shoes', '2026-07-09 09:30:22.115488', '2026-07-09 09:30:22.115488') RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "name" = 'GitOps Shoes', "updated_at" = '2026-07-09 09:30:36.633337' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)