rails-app/app/controllers/registrations_controller.rb

INSERT INTO "users" ("created_at", "date_of_birth", "email_address", "password_digest", "updated_at", "username") VALUES ('2026-07-10 01:39:59.607151', '1904-07-10', 'mypass@gmail.com', '$2a$12$pseUb1a04kbR0tUZJ1RYeu95ewjDCRSkCT.8FQB9Pf6JpiOclCRdq', '2026-07-10 01:39:59.607151', 'AdminUser') RETURNING "id"
---
  def create
    @user = User.new(registration_params)

    if @user.save