rails-app/app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 1
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = 3
SELECT 1 AS one FROM "comments" WHERE "comments"."article_id" = 3 LIMIT 1
---
  <!-- Active Dynamic Comments Feed Section -->
  <h2 class="text-2xl font-bold text-gray-900 mb-4">Comments (<%= @article.comments.count %>)</h2>
  <div id="comments" class="space-y-4 mb-8">
    <% if @article.comments.any? %>
      <% @article.comments.each do |comment| %>