rails-app/app/views/articles/show.html.erb

<!-- 1. ACTIVE DISPLAY LOOP: Prints comments tied to this article record -->
<h2>Comments (<%= @article.comments.count %>)</h2>
<div id="comments" style="margin-bottom: 30px;">
  <% @article.comments.each do |comment| %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = 1
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 1